In [15]:
import pandas as pd

### Convert train

In [16]:
# Total records
train_df = pd.read_csv('./train/enrollment_train.csv')
len(train_df)

72395

In [17]:
train_df.head()

,enrollment_id,username,course_id
0,1,9Uee7oEuuMmgPx2IzPfFkWgkHZyPbWr0,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1,4,FIHlppZyoq8muPbdVxS44gfvceX9zvU7,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
2,5,p1Mp7WkVfzUijX0peVQKSHbgd5pXyl4c,7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx
3,7,I1KwJ6EdCZnEPLfC8Q7yWpIkLOHn7h02,7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx
4,13,hDbSkVrFRj9Ryk3c5E1JYJQLyxm4jLRb,5X6FeZozNMgE2VRi3MJYjkkFK8SETtu2

In [18]:
top_course = train_df.groupby('course_id').course_id.agg(['count']).reset_index().sort_values(by='count', ascending=False)
top_course = top_course['course_id'][:13].tolist()
top_course

['81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv',
 'DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila',
 'I7Go4XwWgpjRJM8EZGEnBpkfSmBNOlsO',
 'H2lDW05SyKnwntZ6Fora76aPAEswcMa5',
 'AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd',
 'SpATywNh6bZuzm8s1ceuBUnMUAeoAHHw',
 'ykoe1cCWK134BJmfbNoPEenJOIWdtQOZ',
 'shM3Yy9vxHn2aqjSYfQXOcwGo0hWh3MI',
 '9Bd26pfDLvkPINwLnpaGcf0LrLUvY1Mz',
 'V4tXq15GxHo2gaMpaJLZ3IGEkP949IbE',
 'a2E7NQC7nZB7WHEhKGhKnKvUWtsLAQzh',
 'NmbZ3BmS8V4pMg6oxXHWpqqMZCE1jvYt',
 '5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6']

In [19]:
new_train_df = train_df[train_df['course_id'].isin(top_course)]
print(len(new_train_df))
new_train_df.head()

48371

,enrollment_id,username,course_id
0,1,9Uee7oEuuMmgPx2IzPfFkWgkHZyPbWr0,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1,4,FIHlppZyoq8muPbdVxS44gfvceX9zvU7,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
5,14,XOhIczT5nEeO52jMq1vN7QziDk8L2jnI,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
6,18,b0Hk5D3sJulvyuC4JEm5kvAvOLAxswgQ,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
7,20,BoK7CAUaCFqnLgmWLxeOHg8YkXUSeCtc,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila

In [20]:
new_train_df[new_train_df['course_id']=='TAYxxh39I2LZnftBpL0LfF2NxzrCKpkx']

Empty DataFrame
Columns: [enrollment_id, username, course_id]
Index: []

In [21]:
# Total username had enrolled more than 2 times
greater5_username = new_train_df.groupby(['username']).filter(lambda x: len(x) >= 5)
unique_greater5_username = greater5_username.username.unique()
len(unique_greater5_username), unique_greater5_username[:10]

(71, array(['61ysO1Pg5Q6bsn73gkzoQt72GbhUHgNd',
        'T6EWQ7jVP89JlHzj41KN1gEtGYevpSQM',
        'yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02',
        'viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk',
        'HAAyQYNYY3ULmqhNC56bxv5FSwyMVoqP',
        'Hj4fYYa64lvHLVeQZBqs9EQ1OtgHTvl6',
        'C6xrhZPOmVH2gCVNP26gSSPka2CcwgB5',
        'M4qxCm572dyAklYyW6rlwVA2xGuuy2h9',
        'SFbTZDEo0JTOG7VHfxeJz2kz3qSzlHq4',
        'GMzSpgZQ6jzVsfHn8W8i83JsYNxnP00b'], dtype=object))

In [22]:
new_train_df = new_train_df[new_train_df['username'].isin(unique_greater5_username)]
len(new_train_df)

383

In [23]:
new_train_df.head()

,enrollment_id,username,course_id
389,1124,61ysO1Pg5Q6bsn73gkzoQt72GbhUHgNd,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd
437,1248,T6EWQ7jVP89JlHzj41KN1gEtGYevpSQM,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
628,1758,yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd
710,1967,viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6
766,2109,HAAyQYNYY3ULmqhNC56bxv5FSwyMVoqP,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6

In [24]:
len(top_course), len(unique_greater5_username)

(13, 71)

### New dataset

In [25]:
username = new_train_df.username.unique()
new_username = list(['user{}'.format(i) for i in range(len(username))])

dict_username = dict(zip(username, new_username))
len(username), username[:10], new_username[:10]

(71, array(['61ysO1Pg5Q6bsn73gkzoQt72GbhUHgNd',
        'T6EWQ7jVP89JlHzj41KN1gEtGYevpSQM',
        'yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02',
        'viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk',
        'HAAyQYNYY3ULmqhNC56bxv5FSwyMVoqP',
        'Hj4fYYa64lvHLVeQZBqs9EQ1OtgHTvl6',
        'C6xrhZPOmVH2gCVNP26gSSPka2CcwgB5',
        'M4qxCm572dyAklYyW6rlwVA2xGuuy2h9',
        'SFbTZDEo0JTOG7VHfxeJz2kz3qSzlHq4',
        'GMzSpgZQ6jzVsfHn8W8i83JsYNxnP00b'], dtype=object), ['user0',
  'user1',
  'user2',
  'user3',
  'user4',
  'user5',
  'user6',
  'user7',
  'user8',
  'user9'])

In [26]:
course_id = top_course
new_course_id = list(['course{}'.format(i) for i in range(len(course_id))])

dict_course_id = dict(zip(course_id, new_course_id))
len(course_id), course_id[:10], new_course_id[:10]

(13,
 ['81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv',
  'DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila',
  'I7Go4XwWgpjRJM8EZGEnBpkfSmBNOlsO',
  'H2lDW05SyKnwntZ6Fora76aPAEswcMa5',
  'AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd',
  'SpATywNh6bZuzm8s1ceuBUnMUAeoAHHw',
  'ykoe1cCWK134BJmfbNoPEenJOIWdtQOZ',
  'shM3Yy9vxHn2aqjSYfQXOcwGo0hWh3MI',
  '9Bd26pfDLvkPINwLnpaGcf0LrLUvY1Mz',
  'V4tXq15GxHo2gaMpaJLZ3IGEkP949IbE'],
 ['course0',
  'course1',
  'course2',
  'course3',
  'course4',
  'course5',
  'course6',
  'course7',
  'course8',
  'course9'])

In [27]:
new_train_df['user'] = new_train_df['username'].apply(lambda u: dict_username[u])
new_train_df['user'][:10]

389     user0
437     user1
628     user2
710     user3
766     user4
1187    user5
1575    user6
1615    user6
1815    user7
1899    user8
Name: user, dtype: object

In [28]:
new_train_df['course'] = new_train_df['course_id'].apply(lambda c: dict_course_id[c])
new_train_df['course'][:10]

389      course4
437      course1
628      course4
710     course12
766     course12
1187     course0
1575     course5
1615    course11
1815     course4
1899    course10
Name: course, dtype: object

In [29]:
new_train_df.head()

,enrollment_id,username,course_id,user,course
389,1124,61ysO1Pg5Q6bsn73gkzoQt72GbhUHgNd,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd,user0,course4
437,1248,T6EWQ7jVP89JlHzj41KN1gEtGYevpSQM,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila,user1,course1
628,1758,yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd,user2,course4
710,1967,viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6,user3,course12
766,2109,HAAyQYNYY3ULmqhNC56bxv5FSwyMVoqP,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6,user4,course12

In [30]:
new_train_df.to_csv('./train/enroll_train.csv')

### Use new username, course to apply in test

In [31]:
# Total records
test_df = pd.read_csv('./test/enrollment_test.csv')
len(test_df)

24013

In [32]:
test_df.head()

,enrollment_id,username,course_id
0,30,JPkczYOxyoDZBjwZAAQHmjpSvnPQzwV0,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1,31,6mzGZyDGSLMvgMQyFwXmz47ojS1kH3j6,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
2,45,5Tz6BGN7p1lkmdoopAY1Z5ufYTrUsi9E,7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx
3,48,1ELMItXjpijnCZU4WKxvrVri8AjkR2gf,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd
4,50,LnNj9zDI8D38ixGOYTIjTH2iF5m36v9S,7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx

In [33]:
# user name unique in train_df 
username[:10]

array(['61ysO1Pg5Q6bsn73gkzoQt72GbhUHgNd',
       'T6EWQ7jVP89JlHzj41KN1gEtGYevpSQM',
       'yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02',
       'viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk',
       'HAAyQYNYY3ULmqhNC56bxv5FSwyMVoqP',
       'Hj4fYYa64lvHLVeQZBqs9EQ1OtgHTvl6',
       'C6xrhZPOmVH2gCVNP26gSSPka2CcwgB5',
       'M4qxCm572dyAklYyW6rlwVA2xGuuy2h9',
       'SFbTZDEo0JTOG7VHfxeJz2kz3qSzlHq4',
       'GMzSpgZQ6jzVsfHn8W8i83JsYNxnP00b'], dtype=object)

In [34]:
# course_id unique in train_df 
course_id[:10]

['81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv',
 'DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila',
 'I7Go4XwWgpjRJM8EZGEnBpkfSmBNOlsO',
 'H2lDW05SyKnwntZ6Fora76aPAEswcMa5',
 'AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd',
 'SpATywNh6bZuzm8s1ceuBUnMUAeoAHHw',
 'ykoe1cCWK134BJmfbNoPEenJOIWdtQOZ',
 'shM3Yy9vxHn2aqjSYfQXOcwGo0hWh3MI',
 '9Bd26pfDLvkPINwLnpaGcf0LrLUvY1Mz',
 'V4tXq15GxHo2gaMpaJLZ3IGEkP949IbE']

In [35]:
# Only test if username and course appear in train_df
def inTrain(row):
    if row['username'] in username and row['course_id'] in course_id:
        return True
    return False

In [36]:
in_train = test_df.apply(inTrain, axis=1)
new_test_df = test_df[in_train]
len(new_test_df)

38

In [37]:
new_test_df.head()

,enrollment_id,username,course_id
225,1974,viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk,81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv
329,2843,g3902agYIRHzac78MKVZlvljLMXXNpQ7,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6
641,5311,SFbTZDEo0JTOG7VHfxeJz2kz3qSzlHq4,SpATywNh6bZuzm8s1ceuBUnMUAeoAHHw
890,7447,35E85h2ExBPeTd1VmxNX0GKo8krIMsCP,H2lDW05SyKnwntZ6Fora76aPAEswcMa5
1016,8738,yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02,H2lDW05SyKnwntZ6Fora76aPAEswcMa5

In [38]:
new_test_df['user'] = new_test_df['username'].apply(lambda u: dict_username[u])
new_test_df['user'][:10]

/home/duyvc/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

225      user3
329     user16
641      user8
890     user28
1016     user2
1163     user0
1388    user10
1419    user16
1467    user19
1475    user20
Name: user, dtype: object

In [39]:
new_test_df['course'] = new_test_df['course_id'].apply(lambda c: dict_course_id[c])
new_test_df['course'][:10]

/home/duyvc/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

225      course0
329     course12
641      course5
890      course3
1016     course3
1163     course8
1388     course4
1419     course5
1467     course5
1475     course5
Name: course, dtype: object

In [40]:
new_test_df.head()

,enrollment_id,username,course_id,user,course
225,1974,viuKt4GgrX0rYL5EpHoxJbsiC9TblSuk,81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv,user3,course0
329,2843,g3902agYIRHzac78MKVZlvljLMXXNpQ7,5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6,user16,course12
641,5311,SFbTZDEo0JTOG7VHfxeJz2kz3qSzlHq4,SpATywNh6bZuzm8s1ceuBUnMUAeoAHHw,user8,course5
890,7447,35E85h2ExBPeTd1VmxNX0GKo8krIMsCP,H2lDW05SyKnwntZ6Fora76aPAEswcMa5,user28,course3
1016,8738,yZ9FndAKqVsKwZtO1B2JJJblefdbhZ02,H2lDW05SyKnwntZ6Fora76aPAEswcMa5,user2,course3

In [41]:
new_test_df.to_csv('./test/enroll_test.csv')